# Introduction to Pandas

# Series

A series is a one-dimesnional array wih axis labels(an index)

In [1]:
#importing libraries and packages
import numpy as np
import pandas as pd

In [5]:
x = pd.Series([10,20,30,40,50])
x

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [6]:
# We can access different components seperately:
# Accessing the index
x.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
# Accessing the dtyoe
# A series is an ndarray, hus it's homogeneous and CANNOT store multiple dtypes

x.dtypes

dtype('int64')

In [10]:
# Creating a seris with an Index
data = [450,650,870]
Sales = pd.Series(data, index =["Don", "Mike", "Edwin"])
Sales

Don      450
Mike     650
Edwin    870
dtype: int64

In [11]:
type(Sales)

pandas.core.series.Series

In [12]:
Sales.index

Index(['Don', 'Mike', 'Edwin'], dtype='object')

### Accessing Values

In [17]:
# You can access values using the index name
Sales["Don"]

450

### Checking for Conditions

In [18]:
# You can filter based on conditions.
Sales > 500

Don      False
Mike      True
Edwin     True
dtype: bool

In [20]:
# We can-use these booleans
Sales[[False, True, True]]

Mike     650
Edwin    870
dtype: int64

In [21]:
#If we want to see values greater than 500
Sales[Sales>500]

Mike     650
Edwin    870
dtype: int64

In [22]:
#Checking names in the index
"Don" in Sales

True

In [23]:
#False example
"Sally" in Sales

False

In [25]:
450 in Sales
# 450 is not an inex, it is a value, Thus it will return False

False

### Working with Dictionaries

In [27]:
# Converting a Seris to a dictionary
sales_dict = Sales.to_dict()
sales_dict

{'Don': 450, 'Mike': 650, 'Edwin': 870}

In [33]:
#Converting a dict to a series
sales_ser = pd.Series(sales_dict)
sales_ser

Don      450
Mike     650
Edwin    870
dtype: int64

### Adding entries and working with Nan/null Values

In [37]:
#We can create a new seriees froma n existing series
# if we specify namees in the inex that were NOT there already, NaN values will be assignes
new_sales = pd.Series(Sales, index = ["Don", "Mike", "Sally", "Edwin", "luct"])
new_sales

Don      450.0
Mike     650.0
Sally      NaN
Edwin    870.0
luct       NaN
dtype: float64

In [40]:
# We can check if there are any NaN values in a Series.
#For this we use Numpy!
np.isnan(new_sales)

Don      False
Mike     False
Sally     True
Edwin    False
luct      True
dtype: bool

In [41]:
# To check for NULL values use Pandas?
pd.isnull(new_sales)

Don      False
Mike     False
Sally     True
Edwin    False
luct      True
dtype: bool

### Naming componens in a Series

In [45]:
# Name an index
Sales.index.name = "Sales Person"
Sales

Sales Person
Don      450
Mike     650
Edwin    870
dtype: int64

In [46]:
# Naming a Series
Sales.name = "Total tv sales"
Sales

Sales Person
Don      450
Mike     650
Edwin    870
Name: Total tv sales, dtype: int64

## Dataframes

Dataframes are two-dimensional, size-mutable, potentially heterogeneous tabular data structures. This data structure contains TWO Labelle axes (rows and collumns)

### Creating a Dataframe

In [51]:
# Creating a Dataframe from a list
data = [["Adrian", 20], ["Bethany", 23], ["Chloe", 41]]

# When we create a Dataframe, we can specify what the column names are and the data tupe is
df = pd.DataFrame(data, columns = ["Name", "Age"])

df

      Name  Age
0   Adrian   20
1  Bethany   23
2    Chloe   41

### Creating a DF from a directory

In [69]:
# how do you create a data frame from a repository?
data = data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
data_frames_ID = pd.DataFrame(data)
data_frames_ID

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

### Adding custom indexes

In [58]:
# how to add a custom index?
data_frames_ID.index = ['Alpha', 'Beta', 'Gamma']

data_frames_ID

          Name  Age         City
alpha    Alice   25     New York
beta       Bob   30  Los Angeles
gamma  Charlie   35      Chicago

### Creating a Dataframe from a List of Dictionaries

In [70]:
# how to create a dataframe from a list of dictionaries
# You can do this the same way as creating from one dictionary

data = [
    {'Name': 'Alice', 'Age': 32, 'City': 'New York'},
    {'Name': 'Brian', 'Age': 55, 'City': 'Los Angeles'},
    {'Name': 'Keven', 'Age': 22, 'City': 'Dallas'}
]

# Create DataFrame
dataframe_Ids = pd.DataFrame(data)

dataframe_Ids

    Name  Age         City
0  Alice   32     New York
1  Brian   55  Los Angeles
2  Keven   22       Dallas

### Creating a DataFrame from a Series

In [71]:
# Convert Series to DataFrame
df_sales = Sales.to_frame(name='Sales')

df_sales

              Sales
Sales Person
Don             450
Mike            650
Edwin           870

### Adding a series as a new column on an existing DF

In [73]:
# How do you add a series as a new column on your dataframe?
# You add a new column by naming it in squared brackets and then assign it to the dataframe
gender_series = pd.Series(["Female", "Male", "Male"])
dataframe_Ids["Gender"] = gender_series

dataframe_Ids

    Name  Age         City  Gender
0  Alice   32     New York  Female
1  Brian   55  Los Angeles    Male
2  Keven   22       Dallas    Male

### Shifting/Changing a Dataframe's Index

In [74]:
# You can do this by using some pandas methods
dataframe_Ids_shifted = dataframe_Ids.shift(1)
dataframe_Ids_shifted

    Name   Age         City  Gender
0   None   NaN         None    None
1  Alice  32.0     New York  Female
2  Brian  55.0  Los Angeles    Male

### Filling Missing Values

In [75]:
# How do you fill missing values, can fill wit
# Fill missing values with a specified value
df_filled = dataframe_Ids_shifted.fillna('Unknown')
df_filled

      Name      Age         City   Gender
0  Unknown  Unknown      Unknown  Unknown
1    Alice     32.0     New York   Female
2    Brian     55.0  Los Angeles     Male

### What if We Do Not Want to Fill Every Value with the Same Data?

In [76]:
# Fill with forward fill
df_filled_ffill = dataframe_Ids_shifted.fillna(method='ffill')

df_filled_ffill # Doesnt work as no rows before Unknown

    Name   Age         City  Gender
0   None   NaN         None    None
1  Alice  32.0     New York  Female
2  Brian  55.0  Los Angeles    Male

In [78]:
# Fill with backward fill
df_filled_bfill = dataframe_Ids_shifted.fillna(method='bfill')
df_filled_bfill # Filled with row indice 1

    Name   Age         City  Gender
0  Alice  32.0     New York  Female
1  Alice  32.0     New York  Female
2  Brian  55.0  Los Angeles    Male

### What Does .interpolate() Do?

In [84]:
# This method is used to perform linear interpolation to fill missing values. It works well when the data follows a continous patter
#lets create an example df with missing values (from gpt)
df = pd.DataFrame({'A': [1, None, 3, None, 5]})
df

     A
0  1.0
1  NaN
2  3.0
3  NaN
4  5.0

In [85]:
# We can now interpolate this dataframe using thee correct method
df_interpolated = df.interpolate()
df_interpolated

     A
0  1.0
1  2.0
2  3.0
3  4.0
4  5.0

### How to Drop Values, Rows and Columns

In [87]:
# you can drop values, rows or columns from dataframes using .drop()
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
df

In [88]:
# Dropping a Specific Row
df_dropped_row = df.drop(index=1)
df_dropped_row

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

In [92]:
# Dropping a specific Column
df_dropped_column = df.drop(columns='City')
df_dropped_column

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [94]:
#Drop Rows Based on a Condition
df_filtered = df[df['Age'] <= 30]

df_filtered

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles

In [96]:
# More filtering based on values
# Drop filter rows where 'City' is 'Los Angeles'
df_filtered = df[df['City'] != 'Los Angeles']
df_filtered

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

In [102]:
#Dropping Rows or Columns based on Missing Values
#Add a missing value to dataframe
df_added_nan = df.copy()
df_added_nan.loc[len(df)] = ["Spencer", "76", None]
df_added_nan

      Name Age         City
0    Alice  25     New York
1      Bob  30  Los Angeles
2  Charlie  35      Chicago
3  Spencer  76         None

In [104]:
# drop rows with any NaN Values
df_dropped_nan_row = df_added_nan.dropna()
df_dropped_nan_row

      Name Age         City
0    Alice  25     New York
1      Bob  30  Los Angeles
2  Charlie  35      Chicago

In [106]:
#drop columns with any NAN values
df_dropped_nan_column = df_added_nan.dropna(axis=1)
df_dropped_nan_column

      Name Age
0    Alice  25
1      Bob  30
2  Charlie  35
3  Spencer  76

In [108]:
# Drop columns and Rows Based on a Index
df_dropped_index = df.drop(index = 2)

df_dropped_index

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles

In [109]:
# Drop multiple Items by index

df_dropped_index_mult = df.drop(index = [0,2])
df_dropped_index_mult

  Name  Age         City
1  Bob   30  Los Angeles